START_MESSAGE = (
    "Привет, это Миша. Я написал этого бота сам. "
    "Он отдаёт ссылки на релизы, видео и аккаунты в соцсетях, "
    "гадает на строчках из треков, "
    "отвечает на слегка набивший мне оскомину вопрос "
    "о перспективах и сроках выхода новой музыки, "
    "а также принимает помощь от благодарных слушателей.\n"
    "Полный список команд — под кнопкой Menu."
)


DONATE_MESSAGE = (
    "Рад, что песни отзываются настолько, "
    "что возникает желание меня поддержать. "
    "Спасибо. Миша"
)

FOLLOW_MESSAGE = (
    "Подписаться:"
)

LEARN_MESSAGE = (
    "У меня порой интересуются, выпущу ли новые треки, "
    "и если да, то когда это счастье наступит. "
    "Какие-то песни давно готовы, "
    "какие-то пишутся прямо сейчас, "
    "но выйдут они все, когда стихнет стрельба. "
    "Я слышал доводы, что каждый должен заниматься своим делом, "
    "но, к счастью, могу себе позволить "
    "не выпускать музыку, пока гибнут люди."
)

LISTEN_MESSAGE = (
    "Ссылки на стриминговые сервисы:"
)

ORDER_MESSAGE = (
    "Привет, это Миша. "
    "К счастью или несчастью "
    "(сам всю жизнь думаю то так, то этак), "
    "музыка никогда не кормила меня.\n"
    "Я бэкенд-разработчик. "
    "Написал этого бота на Python, "
    "использовав библиотеку aiogram — "
    "во-первых, креативного промо ради, "
    "а во-вторых — "
    "чтобы продемонстрировать верхушку айсберга "
    "моих потрясающих навыков программирования :)\n"
    "Если тебе нужен свой телеграм-бот — "
    "или Python backend developer "
    "с чувством прекрасного — пиши на почту\n"
    "ban.gully.0o@icloud.com"
)

OTHER_MESSAGE = (
    "Увы, бот не понял команду. "
    "Список команд доступен по кнопке Menu."
)

WATCH_MESSAGE = (
    "Видео:"
)

punchlines = [
    ["Не стоит мешкать — нам не обещан завтрак. Обычно постепенно всё — пока не внезапно.",
     "Играющий тренер",
     "https://youtu.be/uEVLSaIo_RI"],
    ["К чёрту беспроигрышные лотереи.",
     "Напропалую",
     "https://youtu.be/DGKhN3WCmPI"],
    ["Время — совсем не про мелкие правды, время — дистанция истин.",
     "Найдём",
     "https://youtu.be/NiCe9-Nqg0w"],
    ["Видишь грабли — обойди, бля.",
     "Слишком на море",
     "https://youtu.be/2ebb1MFnk8o"],
    ["Если есть персонажи, то сюжет второстепенен.",
     "Хлеб насущный",
     "https://youtu.be/C1DWUpiuUJ4"],
    ["Не можешь стать учителем — стань уроком.",
     "Полубог-полуживотное",
     "https://youtu.be/B-hMu2j9rLw"],
    ["Победа — полдела, дальше — больше.",
     "Викрамадитья",
     "https://youtu.be/lVQEURNbExA"],
    ["Ну да, захотел — и стал! Чё стесняться? Это жизнь!",
     "Сиять",
     "https://youtu.be/c6dJ2uF1ycE"],
    ["То, что не погубит — помотает нервы, вестимо!",
     "Костры амбиций",
     "https://youtu.be/MPwCMyxwVQE"],
    ["Этот путь вовсе не тупиковый — напротив, только он и ведёт к трону.",
     "Наверно",
     "https://youtu.be/V6Ri3PG8Q1Q"],
    ["Единственный козырь в колоде пока не менялся — это твёрдость руки.",
     "Так вышло",
     "https://youtu.be/B2qfITEt7-c"],
    ["Это типа ковчег — а мы тут за тварей.",
     "Белая княгиня",
     "https://youtu.be/I9KUJj2l0I4"],
    ["Истина порой восходит на нервной почве.",
     "Кипарис",
     "https://youtu.be/l5lM6BoRBMk"],
    ["Вполне хватает твоих действий, чтобы не вникать в смысл твоих слов.",
     "Позвони (третий раз за вечер)",
     "https://youtu.be/XGZ842LsPmU"],
    ["Серьёзный мир — только глупости и приятны. Короче, на глупости вся надежда.",
     "А вдруг",
     "https://youtu.be/TE9UFNdOgx8"],
    ["Столько людей полыхнуло впустую, как пух — в каком качестве тебя приглашают к столу?",
     "С любовью",
     "https://youtu.be/HknPbkMPbHI"],
    ["Мальчик боится мяча, пока не разобьют лицо.",
     "Впритык",
     "https://youtu.be/6w1z0BIt2NM"],
    ["Тревога — в тебе и страхи — в тебе, и вопросы вряд ли решит поездка в Тибет.",
     "В тебе",
     "https://youtu.be/wdGVSofJhoA"],
    ["Судьба не подарок — что это меняет?",
     "Что это меняет?",
     "https://youtu.be/RcZvbp4OQSQ"],
    ["Яблоко жизни часто исправляет прикус, и даже кислое надо жевать гордо.",
     "Бездна и воля",
     "https://youtu.be/guLXPG-Auvs"],
    ["Делай много и сильно, делай быстро и сам.",
     "Форвард",
     "https://youtu.be/7SgSIdGBxNQ"],
    ["Играй так, чтоб не слышать ни свист, ни смех. Говорят же: «Жизнь прожить — не поле перейти».",
     "Играй",
     "https://youtu.be/aJbjAc4mSAQ"],
    ["Ждёшь конца проблем — значит, просто ждёшь конца.",
     "Вверх-вниз",
     "https://youtu.be/nScdMv-nbro"],
    ["Сильнее желание — дальше нирвана.",
     "Больше",
     "https://youtu.be/jEEYbRii2y8"],
    ["Релакс — после финала кубка; здесь нет других пенсионных планов.",
     "Саламандра",
     "https://youtu.be/MsaSMWoEzUg"],
    ["Идеи не должны попахивать идиотизмом — они должны или не стесняясь разить им, или ходить по стеночке в пределах парадигмы.",
     "Иметь",
     "https://youtu.be/fWWpglvBP0M"],
    ["Если б награду давали на шару, она б не ценилась нисколько.",
     "Не подведи себя сам",
     "https://youtu.be/QeNoqtzEkx8"],
    ["Перед тем как стать опытным, ты подопытный.",
     "Исповедь",
     "https://youtu.be/luRD0QK6a2I"],
]
