START_MESSAGE = (
    "Привет, это Миша. Я написал этого бота сам. "
    "Он отдаёт ссылки на музыку, видео и аккаунты в соцсетях, "
    "гадает на строчках из треков, "
    "отвечает на слегка набивший мне оскомину вопрос "
    "о перспективах и сроках выхода новых песен, "
    "а также принимает помощь от благодарных слушателей.\n"
    "Полный список команд — под кнопкой «Меню»."
)


DONATE_MESSAGE = (
    "Спасибо."
)

FOLLOW_MESSAGE = (
    "Страницы в соцсетях:"
)

LEARN_MESSAGE = (
    "У меня порой интересуются, выпущу ли новые треки, "
    "и если да, то когда эта благодать наступит. "
    "Какие-то песни давно готовы, "
    "какие-то пишутся прямо сейчас, "
    "но выйдут они все, когда стихнет стрельба. "
    "Я слышал доводы, что каждый должен заниматься своим делом, "
    "но, к счастью, могу себе позволить "
    "не выпускать музыку, пока гибнут люди."
)

LISTEN_MESSAGE = (
    "Стриминговые сервисы:"
)

OTHER_MESSAGE = (
    "Увы, бот не понял команду. "
    "Список команд доступен по кнопке «Меню»."
)

WATCH_MESSAGE = (
    "Видео:"
)
